This topic learn in file
Creating a dataframe
Selection and indexing ofcolumn
Creating a new column 
Selection Rows
Selectiong subsets of Row and column  
Conditional Selection

## creating a dataframe

In [2]:
import numpy as np
import pandas as pd

In [3]:
#the use in desctionary
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
pd.DataFrame(data)# create the daTA AND THE out put and create the table

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
data_list = [ # this list type
    ['abhi', 20, 'New york', 65000],
    ['Anna', 20, 'Pales', 65000],
    ['fg',30, 'Berlin', 65000],
    ['gh', 40, 'londen', 65000]
]
df2 =pd.DataFrame(data_list)
columns =['Name', 'age','city','salary']

In [6]:
pd.DataFrame(df2) # automatic the create the index

      0   1         2      3
0  abhi  20  New york  65000
1  Anna  20     Pales  65000
2    fg  30    Berlin  65000
3    gh  40    londen  65000

In [ ]:
df2 =pd.DataFrame(data_list,columns=columns) # the add the columns in output
pd.DataFrame(df2)#columns=columns is the index type in columns

   Name  age      city  salary
0  abhi   20  New york   65000
1  Anna   20     Pales   65000
2    fg   30    Berlin   65000
3    gh   40    londen   65000

## Selection and indexing ofcolumn

In [25]:
df2 # the create the upper the coloumns

   Name  age      city  salary
0  abhi   20  New york   65000
1  Anna   20     Pales   65000
2    fg   30    Berlin   65000
3    gh   40    londen   65000

In [31]:
df2['Name']# this is use in indexing in columns name

0    abhi
1    Anna
2      fg
3      gh
Name: Name, dtype: object

In [34]:
df2['age']

0    20
1    20
2    30
3    40
Name: age, dtype: int64

In [37]:
df2[["Name","city","salary"]] # this is two or more column in used in dubble quidrat

   Name      city  salary
0  abhi  New york   65000
1  Anna     Pales   65000
2    fg    Berlin   65000
3    gh    londen   65000

In [74]:
df2["Degree"] =["doctor","engeneer","CoumputerSci","BCA"]# create this new column in add
df2

   Name      city  salary        Degree
0  abhi  New york   65000        doctor
1  Anna     Pales   65000      engeneer
2    fg    Berlin   65000  CoumputerSci
3    gh    londen   65000           BCA

In [87]:
df2.drop("Degree",axis=1) # the removing column of copy

   Name  salary
0  abhi   65000
1  Anna   65000
2    fg   65000
3    gh   65000

In [92]:
df2.drop(0,axis=0) #remove this row wise

   Name  salary        Degree
1  Anna   65000      engeneer
2    fg   65000  CoumputerSci
3    gh   65000           BCA

In [93]:
df2

   Name  salary        Degree
0  abhi   65000        doctor
1  Anna   65000      engeneer
2    fg   65000  CoumputerSci
3    gh   65000           BCA

In [94]:
df2.drop('Degree', axis=1, inplace=True) # this is permenent delete row and column

## Selectiog the Rows

In [95]:
df2

   Name  salary
0  abhi   65000
1  Anna   65000
2    fg   65000
3    gh   65000

In [103]:
df2["age"] = [10,20,25,30]
df2["city"] = ["pune","karanji","Sabra","gaidhala"]
df2

   Name  salary  age      city
0  abhi   65000   10      pune
1  Anna   65000   20   karanji
2    fg   65000   25     Sabra
3    gh   65000   30  gaidhala

In [107]:
df2.loc[[0,1]] #the data location rowwise select and columnwise

   Name  salary  age     city
0  abhi   65000   10     pune
1  Anna   65000   20  karanji

In [113]:
df2.iloc[3]# this is use in index location

Name            gh
salary       65000
age             30
city      gaidhala
Name: 3, dtype: object

In [115]:
df2

   Name  salary  age      city
0  abhi   65000   10      pune
1  Anna   65000   20   karanji
2    fg   65000   25     Sabra
3    gh   65000   30  gaidhala

## Selecting Subsets of Rows and Columns

In [120]:
df2.loc[[0,1]] [["age","city"]]# the first time select the row and second type in select column

   age     city
0   10     pune
1   20  karanji

In [128]:
df2.loc[[2,3]] [["Name","salary"]]

  Name  salary
2   fg   65000
3   gh   65000

## Conditional Selection

In [ ]:
df2[df2["age"] > 20 ] # I only want to see those people whose age is  above 30

  Name  salary  age      city
2   fg   65000   25     Sabra
3   gh   65000   30  gaidhala

In [ ]:
df2[(df2["age"] > 20) & (df2["city"] == "Sabra")]  #I ONLY want people whose age is above 30 and their city must be paris

  Name  salary  age   city
2   fg   65000   25  Sabra